Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_misc.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_misc.c
 *    Mcxnex Miscellaneous routines - Address Handle, Multicast, Protection
 *    Domain, and port-related operations
 *
 *    Implements all the routines necessary for allocating, freeing, querying
 *    and modifying Address Handles and Protection Domains.  Also implements
 *    all the routines necessary for adding and removing Queue Pairs to/from
 *    Multicast Groups.  Lastly, it implements the routines necessary for
 *    port-related query and modify operations.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/bitmap.h>
#include <sys/sysmacros.h>

#include "mcxnex.h"

extern uint32_t mcxnex_kernel_data_ro;

/* used for helping uniquify fmr pool taskq name */
static uint_t mcxnex_debug_fmrpool_cnt = 0x00000000;

static int mcxnex_mcg_qplist_add(mcxnex_state_t *state, mcxnex_mcghdl_t mcg,
    mcxnex_hw_mcg_qp_list_t *mcg_qplist, mcxnex_qphdl_t qp, uint_t *qp_found);
static int mcxnex_mcg_qplist_remove(mcxnex_mcghdl_t mcg,
    mcxnex_hw_mcg_qp_list_t *mcg_qplist, mcxnex_qphdl_t qp);
static void mcxnex_qp_mcg_refcnt_inc(mcxnex_qphdl_t qp);
static void mcxnex_qp_mcg_refcnt_dec(mcxnex_qphdl_t qp);
static uint_t mcxnex_mcg_walk_mgid_hash(mcxnex_state_t *state,
    uint64_t start_indx, ib_gid_t mgid, uint_t *prev_indx);
static void mcxnex_mcg_setup_new_hdr(mcxnex_mcghdl_t mcg,
    mcxnex_hw_mcg_t *mcg_hdr, ib_gid_t mgid, mcxnex_rsrc_t *mcg_rsrc);
static int mcxnex_mcg_hash_list_remove(mcxnex_state_t *state, uint_t curr_indx,
    uint_t prev_indx, mcxnex_hw_mcg_t *mcg_entry);
static int mcxnex_mcg_entry_invalidate(mcxnex_state_t *state,
    mcxnex_hw_mcg_t *mcg_entry, uint_t indx);
static int mcxnex_mgid_is_valid(ib_gid_t gid);
static int mcxnex_mlid_is_valid(ib_lid_t lid);
static void mcxnex_fmr_processing(void *fmr_args);
static int mcxnex_fmr_cleanup(mcxnex_state_t *state, mcxnex_fmrhdl_t pool);
static void mcxnex_fmr_cache_init(mcxnex_fmrhdl_t fmr);
static void mcxnex_fmr_cache_fini(mcxnex_fmrhdl_t fmr);
static int mcxnex_fmr_avl_compare(const void *q, const void *e);


#define	MCXNEX_MAX_DBR_PAGES_PER_USER	64
#define	MCXNEX_DBR_KEY(index, page) \
	(((uint64_t)index) * MCXNEX_MAX_DBR_PAGES_PER_USER + (page))

static mcxnex_udbr_page_t *
mcxnex_dbr_new_user_page(mcxnex_state_t *state, uint_t index,
    uint_t page)
{
	mcxnex_udbr_page_t *pagep;
	ddi_dma_attr_t dma_attr;
	uint_t cookiecnt;
	int status;
	mcxnex_umap_db_entry_t *umapdb;

	pagep = kmem_alloc(sizeof (*pagep), KM_SLEEP);
	pagep->upg_index = page;
	pagep->upg_nfree = PAGESIZE / sizeof (mcxnex_dbr_t);

	/* Allocate 1 bit per dbr for free/alloc management (0 => "free") */
	pagep->upg_free = kmem_zalloc(PAGESIZE / sizeof (mcxnex_dbr_t) / 8,
	    KM_SLEEP);
	pagep->upg_kvaddr = ddi_umem_alloc(PAGESIZE, DDI_UMEM_SLEEP,
	    &pagep->upg_umemcookie); /* not MCXNEX_PAGESIZE here */

	pagep->upg_buf = ddi_umem_iosetup(pagep->upg_umemcookie, 0,
	    PAGESIZE, B_WRITE, 0, 0, NULL, DDI_UMEM_SLEEP);

	mcxnex_dma_attr_init(state, &dma_attr);
	status = ddi_dma_alloc_handle(state->hs_dip, &dma_attr,
	    DDI_DMA_SLEEP, NULL, &pagep->upg_dmahdl);
	if (status != DDI_SUCCESS) {
		cmn_err(CE_WARN,
		    "ddi_dma_alloc_handle failed: %d", status);
		return (NULL);
	}
	status = ddi_dma_buf_bind_handle(pagep->upg_dmahdl,
	    pagep->upg_buf, DDI_DMA_RDWR | DDI_DMA_CONSISTENT,
	    DDI_DMA_SLEEP, NULL, &pagep->upg_dmacookie, &cookiecnt);
	if (status != DDI_SUCCESS) {
		cmn_err(CE_WARN,
		    "ddi_dma_buf_bind_handle failed: %d", status);
		ddi_dma_free_handle(&pagep->upg_dmahdl);
		return (NULL);
	}
	ASSERT(cookiecnt == 1);

	/* create db entry for mmap */
	umapdb = mcxnex_umap_db_alloc(state->hs_instance,
	    MCXNEX_DBR_KEY(index, page), MLNX_UMAP_DBRMEM_RSRC,
	    (uint64_t)(uintptr_t)pagep);
	mcxnex_umap_db_add(umapdb);
	return (pagep);
}


/*ARGSUSED*/
static int
mcxnex_user_dbr_alloc(mcxnex_state_t *state, uint_t index,
    ddi_acc_handle_t *acchdl, mcxnex_dbr_t **vdbr, uint64_t *pdbr,
    uint64_t *mapoffset)
{
	mcxnex_user_dbr_t *udbr;
	mcxnex_udbr_page_t *pagep;
	uint_t next_page;
	int dbr_index;
	int i1, i2, i3, last;
	uint64_t u64, mask;

	mutex_enter(&state->hs_dbr_lock);
	for (udbr = state->hs_user_dbr; udbr != NULL; udbr = udbr->udbr_link)
		if (udbr->udbr_index == index)
			break;
	if (udbr == NULL) {
		udbr = kmem_alloc(sizeof (*udbr), KM_SLEEP);
		udbr->udbr_link = state->hs_user_dbr;
		state->hs_user_dbr = udbr;
		udbr->udbr_index = index;
		udbr->udbr_pagep = NULL;
	}
	pagep = udbr->udbr_pagep;
	next_page = (pagep == NULL) ? 0 : (pagep->upg_index + 1);
	while (pagep != NULL)
		if (pagep->upg_nfree > 0)
			break;
		else
			pagep = pagep->upg_link;
	if (pagep == NULL) {
		pagep = mcxnex_dbr_new_user_page(state, index, next_page);
		if (pagep == NULL) {
			mutex_exit(&state->hs_dbr_lock);
			return (DDI_FAILURE);
		}
		pagep->upg_link = udbr->udbr_pagep;
		udbr->udbr_pagep = pagep;
	}

	/* Since nfree > 0, we're assured the loops below will succeed */

	/* First, find a 64-bit (not ~0) that has a free dbr */
	last = PAGESIZE / sizeof (uint64_t) / 64;
	mask = ~0ull;
	for (i1 = 0; i1 < last; i1++)
		if ((pagep->upg_free[i1] & mask) != mask)
			break;
	u64 = pagep->upg_free[i1];

	/* Second, find a byte (not 0xff) that has a free dbr */
	last = sizeof (uint64_t) / sizeof (uint8_t);
	for (i2 = 0, mask = 0xff; i2 < last; i2++, mask <<= 8)
		if ((u64 & mask) != mask)
			break;

	/* Third, find a bit that is free (0) */
	for (i3 = 0; i3 < sizeof (uint64_t) / sizeof (uint8_t); i3++)
		if ((u64 & (1ul << (i3 + 8 * i2))) == 0)
			break;

