Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_misc.c
/*
 * mcxnex_dbr_free()
 *	DBr record deallocation - called from free cq/qp
 *	will update the counter in the header, and invalidate
 *	the dbr, but will NEVER free pages of dbrs - small
 *	price to pay, but userland access never will anyway
 */
void
mcxnex_dbr_free(mcxnex_state_t *state, uint_t indx, mcxnex_dbr_t *record)
{
	mcxnex_dbr_t		*page;
	mcxnex_dbr_info_t	*info;

	if (indx != state->hs_kernel_uar_index) {
		mcxnex_user_dbr_free(state, indx, record);
		return;
	}
	page = (mcxnex_dbr_t *)(uintptr_t)((uintptr_t)record & PAGEMASK);
	mutex_enter(&state->hs_dbr_lock);
	for (info = state->hs_kern_dbr; info != NULL; info = info->dbr_link)
		if (info->dbr_page == page)
			break;
	ASSERT(info != NULL);
	*record = info->dbr_firstfree;
	info->dbr_firstfree = record - info->dbr_page;
	info->dbr_nfree++;
	mutex_exit(&state->hs_dbr_lock);
}

/*
 * mcxnex_dbr_kern_free()
 *    Context: Can be called only from detach context.
 *
 *	Free all kernel dbr pages.  This includes the freeing of all the dma
 *	resources acquired during the allocation of the pages.
 *
 *	Also, free all the user dbr pages.
 */
void
mcxnex_dbr_kern_free(mcxnex_state_t *state)
{
	mcxnex_dbr_info_t	*info, *link;
	mcxnex_user_dbr_t	*udbr, *next;
	mcxnex_udbr_page_t	*pagep, *nextp;
	mcxnex_umap_db_entry_t	*umapdb;
	int			instance, status;
	uint64_t		value;
	extern			mcxnex_umap_db_t mcxnex_userland_rsrc_db;

	mutex_enter(&state->hs_dbr_lock);
	for (info = state->hs_kern_dbr; info != NULL; info = link) {
		(void) ddi_dma_unbind_handle(info->dbr_dmahdl);
		ddi_dma_mem_free(&info->dbr_acchdl);	/* free page */
		ddi_dma_free_handle(&info->dbr_dmahdl);
		link = info->dbr_link;
		kmem_free(info, sizeof (mcxnex_dbr_info_t));
	}

	udbr = state->hs_user_dbr;
	instance = state->hs_instance;
	mutex_enter(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	while (udbr != NULL) {
		pagep = udbr->udbr_pagep;
		while (pagep != NULL) {
			/* probably need to remove "db" */
			(void) ddi_dma_unbind_handle(pagep->upg_dmahdl);
			ddi_dma_free_handle(&pagep->upg_dmahdl);
			freerbuf(pagep->upg_buf);
			ddi_umem_free(pagep->upg_umemcookie);
			status = mcxnex_umap_db_find_nolock(instance,
			    MCXNEX_DBR_KEY(udbr->udbr_index,
			    pagep->upg_index), MLNX_UMAP_DBRMEM_RSRC,
			    &value, MCXNEX_UMAP_DB_REMOVE, &umapdb);
			if (status == DDI_SUCCESS)
				mcxnex_umap_db_free(umapdb);
			kmem_free(pagep->upg_free,
			    PAGESIZE / sizeof (mcxnex_dbr_t) / 8);
			nextp = pagep->upg_link;
			kmem_free(pagep, sizeof (*pagep));
			pagep = nextp;
		}
		next = udbr->udbr_link;
		kmem_free(udbr, sizeof (*udbr));
		udbr = next;
	}
	mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	mutex_exit(&state->hs_dbr_lock);
}

/*
 * mcxnex_ah_alloc()
 *    Context: Can be called only from user or kernel context.
 */
int
mcxnex_ah_alloc(mcxnex_state_t *state, mcxnex_pdhdl_t pd,
    ibt_adds_vect_t *attr_p, mcxnex_ahhdl_t *ahhdl, uint_t sleepflag)
{
	mcxnex_rsrc_t		*rsrc;
	mcxnex_hw_udav_t	*udav;
	mcxnex_ahhdl_t		ah;
	int			status;

	/*
	 * Someday maybe the "ibt_adds_vect_t *attr_p" will be NULL to
	 * indicate that we wish to allocate an "invalid" (i.e. empty)
	 * address handle XXX
	 */

	/* Validate that specified port number is legal */
	if (!mcxnex_portnum_is_valid(state, attr_p->av_port_num)) {
		return (IBT_HCA_PORT_INVALID);
	}

	/*
	 * Allocate the software structure for tracking the address handle
	 * (i.e. the Mcxnex Address Handle struct).
	 */
	status = mcxnex_rsrc_alloc(state, MCXNEX_AHHDL, 1, sleepflag, &rsrc);
	if (status != DDI_SUCCESS) {
		return (IBT_INSUFF_RESOURCE);
	}
	ah = (mcxnex_ahhdl_t)rsrc->hr_addr;
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*ah))

	/* Increment the reference count on the protection domain (PD) */
	mcxnex_pd_refcnt_inc(pd);

	udav = (mcxnex_hw_udav_t *)kmem_zalloc(sizeof (mcxnex_hw_udav_t),
	    KM_SLEEP);
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*udav))

	/*
	 * Fill in the UDAV data. We first zero out the UDAV, then populate
	 * it by then calling mcxnex_set_addr_path() to fill in the common
	 * portions that can be pulled from the "ibt_adds_vect_t" passed in
	 */
	status = mcxnex_set_addr_path(state, attr_p,
	    (mcxnex_hw_addr_path_t *)udav, MCXNEX_ADDRPATH_UDAV);
	if (status != DDI_SUCCESS) {
		mcxnex_pd_refcnt_dec(pd);
		mcxnex_rsrc_free(state, &rsrc);
		return (status);
	}
	udav->pd	= pd->pd_pdnum;
	udav->sl	= attr_p->av_srvl;

	/*
	 * Fill in the rest of the Mcxnex Address Handle struct.
	 *
	 * NOTE: We are saving away a copy of the "av_dgid.gid_guid" field
	 * here because we may need to return it later to the IBTF (as a
	 * result of a subsequent query operation).  Unlike the other UDAV
	 * parameters, the value of "av_dgid.gid_guid" is not always preserved.
	 * The reason for this is described in mcxnex_set_addr_path().
	 */
	ah->ah_rsrcp	 = rsrc;
	ah->ah_pdhdl	 = pd;
	ah->ah_udav	 = udav;
	ah->ah_save_guid = attr_p->av_dgid.gid_guid;
	*ahhdl = ah;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_ah_free()
 *    Context: Can be called only from user or kernel context.
 */
/* ARGSUSED */
int
mcxnex_ah_free(mcxnex_state_t *state, mcxnex_ahhdl_t *ahhdl, uint_t sleepflag)
{
	mcxnex_rsrc_t		*rsrc;
	mcxnex_pdhdl_t		pd;
	mcxnex_ahhdl_t		ah;

	/*
	 * Pull all the necessary information from the Mcxnex Address Handle
	 * struct.  This is necessary here because the resource for the
	 * AH is going to be freed up as part of this operation.
	 */
	ah    = *ahhdl;
	mutex_enter(&ah->ah_lock);
	rsrc  = ah->ah_rsrcp;
	pd    = ah->ah_pdhdl;
	mutex_exit(&ah->ah_lock);
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*ah))

	/* Free the UDAV memory */
	kmem_free(ah->ah_udav, sizeof (mcxnex_hw_udav_t));

	/* Decrement the reference count on the protection domain (PD) */
	mcxnex_pd_refcnt_dec(pd);

	/* Free the Mcxnex Address Handle structure */
	mcxnex_rsrc_free(state, &rsrc);

	/* Set the ahhdl pointer to NULL and return success */
	*ahhdl = NULL;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_ah_query()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
int
mcxnex_ah_query(mcxnex_state_t *state, mcxnex_ahhdl_t ah, mcxnex_pdhdl_t *pd,
    ibt_adds_vect_t *attr_p)
{
	mutex_enter(&ah->ah_lock);
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*attr_p))

