Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_misc.c
		/*
		 * We drop the lock and return success.
		 */
		mutex_exit(&state->hs_mcglock);
		return (DDI_SUCCESS);
	}

	/*
	 * If we've reached here, then we're at the end of the hash chain.
	 * We need to allocate a new MCG entry, fill it in, write it to Mcxnex,
	 * and update the previous entry to link the new one to the end of the
	 * chain.
	 */

	/*
	 * Allocate an MCG table entry.  This will be filled in with all
	 * the necessary parameters to define the multicast group.  Then it
	 * will be written to the hardware in the next-to-last step below.
	 */
	status = mcxnex_rsrc_alloc(state, MCXNEX_MCG, 1, DDI_NOSLEEP, &rsrc);
	if (status != DDI_SUCCESS) {
		mutex_exit(&state->hs_mcglock);
		return (IBT_INSUFF_RESOURCE);
	}

	/*
	 * Fill in the new entry in the "shadow" MCG list.  Note:  Just as
	 * it does above, mcxnex_mcg_setup_new_hdr() also fills in a portion
	 * of the temporary MCG entry (the rest of which will be filled in by
	 * mcxnex_mcg_qplist_add() below)
	 */
	newmcg = &state->hs_mcghdl[rsrc->hr_indx];
	mcxnex_mcg_setup_new_hdr(newmcg, mcg_entry, gid, rsrc);

	/*
	 * Try to add the new QP number to the list.  This routine fills in
	 * the final necessary pieces of the temporary MCG.  The
	 * "mcg_entry_qplist" pointer is used to point to the portion of the
	 * temporary MCG that holds the QP numbers.  If we fail here, we
	 * must undo the previous resource allocation.
	 *
	 * Note: mcxnex_mcg_qplist_add() can we return SUCCESS if it already
	 * found the QP in the list.  In this case, the QP is not added on to
	 * the list again.  Check the flag 'qp_found' if this value is needed
	 * to be known.
	 */
	status = mcxnex_mcg_qplist_add(state, newmcg, mcg_entry_qplist, qp,
	    &qp_found);
	if (status != DDI_SUCCESS) {
		bzero(newmcg, sizeof (struct mcxnex_sw_mcg_list_s));
		mcxnex_rsrc_free(state, &rsrc);
		mutex_exit(&state->hs_mcglock);
		return (status);
	}
	mcg_entry->member_cnt = (newmcg->mcg_num_qps + 1);
	    /* set the member count */

	/*
	 * Once the temporary MCG has been updated, write the entry into the
	 * appropriate location in the Mcxnex MCG entry table.  If this is
	 * successful, then we need to chain the previous entry to this one.
	 * Note: In general, this operation shouldn't fail.  If it does, then
	 * it is an indication that something (probably in HW, but maybe in
	 * SW) has gone seriously wrong.
	 */
	status = mcxnex_write_mgm_cmd_post(state, mcg_entry, rsrc->hr_indx,
	    DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		bzero(newmcg, sizeof (struct mcxnex_sw_mcg_list_s));
		mcxnex_rsrc_free(state, &rsrc);
		mutex_exit(&state->hs_mcglock);
		MCXNEX_WARNING(state, "failed to write MCG entry");
		cmn_err(CE_CONT, "Mcxnex: WRITE_MGM command failed: %08x\n",
		    status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		return (DDI_FAILURE);
	}

	/*
	 * Now read the current MCG entry (the one previously at the end of
	 * hash chain) into the temporary MCG.  We are going to update its
	 * "next_gid_indx" now and write the entry back to the MCG table.
	 * Note:  In general, this operation shouldn't fail.  If it does, then
	 * it is an indication that something (probably in HW, but maybe in SW)
	 * has gone seriously wrong.  We will free up the MCG entry resource,
	 * but we will not undo the previously written MCG entry in the HW.
	 * This is OK, though, because the MCG entry is not currently attached
	 * to any hash chain.
	 */
	status = mcxnex_read_mgm_cmd_post(state, mcg_entry, end_indx,
	    DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		bzero(newmcg, sizeof (struct mcxnex_sw_mcg_list_s));
		mcxnex_rsrc_free(state, &rsrc);
		mutex_exit(&state->hs_mcglock);
		MCXNEX_WARNING(state, "failed to read MCG entry");
		cmn_err(CE_CONT, "Mcxnex: READ_MGM command failed: %08x\n",
		    status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		return (DDI_FAILURE);
	}

	/*
	 * Finally, we update the "next_gid_indx" field in the temporary MCG
	 * and attempt to write the entry back into the Mcxnex MCG table.  If
	 * this succeeds, then we update the "shadow" list to reflect the
	 * change, drop the lock, and return success.  Note:  In general, this
	 * operation shouldn't fail.  If it does, then it is an indication
	 * that something (probably in HW, but maybe in SW) has gone seriously
	 * wrong.  Just as we do above, we will free up the MCG entry resource,
	 * but we will not try to undo the previously written MCG entry.  This
	 * is OK, though, because (since we failed here to update the end of
	 * the chain) that other entry is not currently attached to any chain.
	 */
	mcg_entry->next_gid_indx = rsrc->hr_indx;
	status = mcxnex_write_mgm_cmd_post(state, mcg_entry, end_indx,
	    DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		bzero(newmcg, sizeof (struct mcxnex_sw_mcg_list_s));
		mcxnex_rsrc_free(state, &rsrc);
		mutex_exit(&state->hs_mcglock);
		MCXNEX_WARNING(state, "failed to write MCG entry");
		cmn_err(CE_CONT, "Mcxnex: WRITE_MGM command failed: %08x\n",
		    status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		return (DDI_FAILURE);
	}
	mcg = &state->hs_mcghdl[end_indx];
	mcg->mcg_next_indx = rsrc->hr_indx;

	/*
	 * Now that we know all the Mcxnex firmware accesses have been
	 * successful, we update the new "shadow" MCG entry by incrementing
	 * the "number of attached QPs" count.  Then we drop the lock and
	 * return success.
	 */
	newmcg->mcg_num_qps++;

	/*
	 * Increment the refcnt for this QP.  Because the QP
	 * was added to this MCG, the refcnt must be
	 * incremented.
	 */
	mcxnex_qp_mcg_refcnt_inc(qp);

	mutex_exit(&state->hs_mcglock);
	return (DDI_SUCCESS);
}


/*
 * mcxnex_mcg_detach()
 *    Context: Can be called only from user or kernel context.
 */
int
mcxnex_mcg_detach(mcxnex_state_t *state, mcxnex_qphdl_t qp, ib_gid_t gid,
    ib_lid_t lid)
{
	mcxnex_hw_mcg_t		*mcg_entry;
	mcxnex_hw_mcg_qp_list_t	*mcg_entry_qplist;
	mcxnex_mcghdl_t		mcg;
	uint64_t		mgid_hash;
	uint32_t		end_indx, prev_indx;
	int			status;

